<a href="https://colab.research.google.com/github/divyansh1195/Halliburton-Landmark-Learning/blob/master/Data%20Science%20using%20Python(Halliburton)/Merge_join_in_python.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Merge/join 2 different datasets using pandas

In [1]:
import pandas as pd

In [2]:
#create 2 different dataframes

In [3]:
X=pd.DataFrame({
    'id':[1,2,3,4,5],
    'Name':['A', 'B','C','D','E'],
    'subject_id':['Maths', 'Eng','SST','Science','Hindi']})

In [4]:
Y=pd.DataFrame({
    'id':[1, 2 ,3 , 4,5],
    'Name':['F', 'G','H','I','J'],
    'subject_id':['Maths', 'Eng','SST','Science','Hindi']})

In [5]:
print(X)

   id Name subject_id
0   1    A      Maths
1   2    B        Eng
2   3    C        SST
3   4    D    Science
4   5    E      Hindi

In [6]:
print(Y)

   id Name subject_id
0   1    F      Maths
1   2    G        Eng
2   3    H        SST
3   4    I    Science
4   5    J      Hindi

In [7]:
#merge dataframes on a key

In [8]:
merge_key=pd.merge(X,Y, on='id')

In [9]:
merge_key

   id Name_x subject_id_x Name_y subject_id_y
0   1      A        Maths      F        Maths
1   2      B          Eng      G          Eng
2   3      C          SST      H          SST
3   4      D      Science      I      Science
4   5      E        Hindi      J        Hindi

In [10]:
merge_key_sub =pd.merge(X,Y, on='subject_id')

In [11]:
merge_key_sub

   id_x Name_x subject_id  id_y Name_y
0     1      A      Maths     1      F
1     2      B        Eng     2      G
2     3      C        SST     3      H
3     4      D    Science     4      I
4     5      E      Hindi     5      J

In [12]:
#merge 2 datasets on multiple keys

In [13]:
merge_key_2=pd.merge(X,Y, on=['id','subject_id'] )

In [14]:
merge_key_2

   id Name_x subject_id Name_y
0   1      A      Maths      F
1   2      B        Eng      G
2   3      C        SST      H
3   4      D    Science      I
4   5      E      Hindi      J

In [15]:
frames=[X,Y]
pd.concat(frames)

   id Name subject_id
0   1    A      Maths
1   2    B        Eng
2   3    C        SST
3   4    D    Science
4   5    E      Hindi
0   1    F      Maths
1   2    G        Eng
2   3    H        SST
3   4    I    Science
4   5    J      Hindi

#merge on 'how' argument 
how='left', 'right', 'outer_join', 'inner_join'

In [16]:
X_1=pd.DataFrame({
    'id':[1,2,4,5,6],
    'Name':['A','C','D','E','H'],
    'subject_id':['Maths1', 'Eng1','SST','Science','Hindi2']})

In [17]:
Y_1=pd.DataFrame({
    'id':[1, 3 ,5 , 8,9],
    'Name':['F', 'G','A','K','J'],
    'subject_id':['Maths2', 'Eng1','SST','Science','Hindi1']})

In [18]:
print(X_1)

   id Name subject_id
0   1    A     Maths1
1   2    C       Eng1
2   4    D        SST
3   5    E    Science
4   6    H     Hindi2

In [19]:
print(Y_1)

   id Name subject_id
0   1    F     Maths2
1   3    G       Eng1
2   5    A        SST
3   8    K    Science
4   9    J     Hindi1

In [20]:
result=[X_1,Y_1]

In [21]:
pd.concat(result)

   id Name subject_id
0   1    A     Maths1
1   2    C       Eng1
2   4    D        SST
3   5    E    Science
4   6    H     Hindi2
0   1    F     Maths2
1   3    G       Eng1
2   5    A        SST
3   8    K    Science
4   9    J     Hindi1

In [22]:
merge_X1Y1=pd.merge(X_1,Y_1, on=['id'] )

In [23]:
merge_X1Y1

   id Name_x subject_id_x Name_y subject_id_y
0   1      A       Maths1      F       Maths2
1   5      E      Science      A          SST

In [24]:
merge_X1Y1_2=pd.merge(X_1,Y_1, on=['subject_id'] )

In [25]:
merge_X1Y1_2

   id_x Name_x subject_id  id_y Name_y
0     2      C       Eng1     3      G
1     4      D        SST     5      A
2     5      E    Science     8      K

In [26]:
merge_X1Y1_3=pd.merge(X_1,Y_1, left_on='id', right_on='id')

In [27]:
merge_X1Y1_3

   id Name_x subject_id_x Name_y subject_id_y
0   1      A       Maths1      F       Maths2
1   5      E      Science      A          SST

In [28]:
merge_X1Y1_4=pd.merge(X_1,Y_1, on='id', how='outer')

In [29]:
merge_X1Y1_4

   id Name_x subject_id_x Name_y subject_id_y
0   1      A       Maths1      F       Maths2
1   2      C         Eng1    NaN          NaN
2   4      D          SST    NaN          NaN
3   5      E      Science      A          SST
4   6      H       Hindi2    NaN          NaN
5   3    NaN          NaN      G         Eng1
6   8    NaN          NaN      K      Science
7   9    NaN          NaN      J       Hindi1

In [30]:
merge_X1Y1_5=pd.merge(X_1,Y_1, on='id', how='inner')

In [31]:
merge_X1Y1_5

   id Name_x subject_id_x Name_y subject_id_y
0   1      A       Maths1      F       Maths2
1   5      E      Science      A          SST

In [32]:
merge_X1Y1_6=pd.merge(X_1,Y_1, on='id', how='right')

In [33]:
merge_X1Y1_6

   id Name_x subject_id_x Name_y subject_id_y
0   1      A       Maths1      F       Maths2
1   5      E      Science      A          SST
2   3    NaN          NaN      G         Eng1
3   8    NaN          NaN      K      Science
4   9    NaN          NaN      J       Hindi1

In [34]:
merge_X1Y1_7=pd.merge(X_1,Y_1, on='id', how='left')

In [35]:
merge_X1Y1_7

   id Name_x subject_id_x Name_y subject_id_y
0   1      A       Maths1      F       Maths2
1   2      C         Eng1    NaN          NaN
2   4      D          SST    NaN          NaN
3   5      E      Science      A          SST
4   6      H       Hindi2    NaN          NaN